TestingTool_3-0/src/InformationRegisters/СостояниеУчастниковДляЧата/СостояниеУчастниковДляЧата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеУчастниковДляЧата</name>
  <resources>
    <name>НомерПорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВСети</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТестируемыйКлиент</name>
    <type>
      <types>CatalogRef.ТестируемыеКлиенты</types>
    </type>
  </resources>
  <resources>
    <name>Проверка</name>
    <type>
      <types>CatalogRef.Проверки</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВхода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТочкаВхода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейАктивностиУнив</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>PID</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/InformationRegisters/УчастникиДляЧата/УчастникиДляЧата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиДляЧата</name>
  <resources>
    <name>Участник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/InformationRegisters/КомнатыДляЧата/КомнатыДляЧата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомнатыДляЧата</name>
  <resources>
    <name>Комната</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторАдминистратора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Проверка</name>
    <type>
      <types>CatalogRef.Проверки</types>
    </type>
  </resources>
  <resources>
    <name>Сборка</name>
    <type>
      <types>CatalogRef.Сборки</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторКомнаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/InformationRegisters/СоставКомнатыДляЧата/СоставКомнатыДляЧата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставКомнатыДляЧата</name>
  <dimensions>
    <name>ИдентификаторКомнаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/InformationRegisters/СтатусыСообщенийЧата/СтатусыСообщенийЧата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыСообщенийЧата</name>
  <resources>
    <name>Получено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/InformationRegisters/СообщенияИзЧата/СообщенияИзЧата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияИзЧата</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяЖизни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоОбщийКанал</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомнаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСообщенияУнив</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/CommonModules/ОбщийЧатСервер/Module.bsl
#Область ОбслуживаниеЧата

Процедура ОбслуживаниеОбщегоЧата() Экспорт
	
	ОтключитьУснувшихУчастников();
	
КонецПроцедуры

// Процедура - Отключить уснувших участников
// по таймеру
Процедура ОтключитьУснувшихУчастников() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУЧ.ИдентификаторУчастника КАК ИдентификаторУчастника,
	|	ИСТИНА КАК Отключить
	|ИЗ
	|	РегистрСведений.СостояниеУчастниковДляЧата КАК СУЧ
	|ГДЕ
	|	РАЗНОСТЬДАТ(СУЧ.ДатаПоследнейАктивности, &ТекущаяДата, СЕКУНДА) > &ВремяСна
	|	И СУЧ.ВСети = ИСТИНА";
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("ВремяСна",600);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Отключить=Истина Тогда
			МенеджерЗаписи = РегистрыСведений.СостояниеУчастниковДляЧата.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ИдентификаторУчастника=Выборка.ИдентификаторУчастника;
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.НомерПорта=0;
			МенеджерЗаписи.ВСети=Ложь;
			МенеджерЗаписи.ДатаВыхода=ТекущаяДата();
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область УчастникиЧата

Функция ЗарегистрироватьсяВОбщийЧат1С(Знач Логин, Знач Порт, Знач ТочкаВхода,Знач ИдентификаторУчастника="",Знач PID=0,Знач ИспользоватьСуществуюущего=Ложь) Экспорт
	
	ИмяВхода = Логин;
	НомерПорта = Порт;
	Операция = "добавить";
	
	Если НЕ ИдентификаторУчастника="" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	СУЧ.Участник КАК Участник,
		|	СУЧ.ИдентификаторУчастника КАК ИдентификаторУчастника
		|ИЗ
		|	РегистрСведений.УчастникиДляЧата КАК СУЧ
		|ГДЕ
		|	СУЧ.ИдентификаторУчастника = &ИдентификаторУчастника";
		Запрос.УстановитьПараметр("ИдентификаторУчастника",ИдентификаторУчастника);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ИдентификаторУчастника = Выборка.ИдентификаторУчастника;
			ИмяВхода = Выборка.Участник;
			Операция="обновить";
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ИдентификаторУчастника="" Тогда
		ИдентификаторУчастника = Строка(Новый UUID());
	КонецЕсли;
	
	Если Операция = "добавить" Тогда
		// проверим на наличие уже такого участника
		// нет проверки что это я
		Запрос = Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	СУЧ.Участник КАК Участник
		|ИЗ
		|	РегистрСведений.УчастникиДляЧата КАК СУЧ
		|ГДЕ
		|	СУЧ.Участник = &Участник";
		Запрос.УстановитьПараметр("Участник",Логин);
		Выборка = Запрос.Выполнить().Выбрать();
		// TODO: новое имя обычно присылает сервер, но пкоа костыль
		Если Выборка.Следующий() Тогда // нужно сформировать новое имя
			//Выбираем всех подобных
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПЕРВЫЕ 1","");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"СУЧ.Участник = &Участник","СУЧ.Участник ПОДОБНО &Участник");
			Запрос.УстановитьПараметр("Участник","%"+Логин+"%");
			Выборка = Запрос.Выполнить().Выбрать();
			КешподобныхЛогинов = Новый Соответствие;
			Пока Выборка.Следующий() Цикл
				КешподобныхЛогинов.Вставить(Строка(Выборка.Участник),Строка(Выборка.Участник));
			КонецЦикла;
			//генерим новое имя
			НовоеИмяУспешно = Ложь;
			ш=0;
			Пока НовоеИмяУспешно = Ложь Цикл
				ш=ш+1;
				ИмяВхода = Логин+" "+Строка(ш);
				Если КешподобныхЛогинов.Получить(ИмяВхода)=Неопределено Тогда
					НовоеИмяУспешно=Истина;
				КонецЕсли;
				Если ш=100 Тогда  // много имен генерим гуид
					НовоеИмяУспешно=Истина;
					ИмяВхода = Логин+" "+Строка(Новый UUID());
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;		
	
	// регистрация
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Участник",ИмяВхода);
	СтруктураЗаписи.Вставить("ВСети",Истина);
	СтруктураЗаписи.Вставить("ТестируемыйКлиент",Неопределено);
	СтруктураЗаписи.Вставить("Проверка",Неопределено);
	СтруктураЗаписи.Вставить("ДатаСоздания",ТекущаяДата());
	СтруктураЗаписи.Вставить("ДатаВхода",ТекущаяДата());
	СтруктураЗаписи.Вставить("ДатаПоследнейАктивности",ТекущаяДата());
	СтруктураЗаписи.Вставить("ДатаПоследнейАктивностиУнив",ТекущаяУниверсальнаяДатаВМиллисекундах());
	СтруктураЗаписи.Вставить("ТочкаВхода",ТочкаВхода);
	СтруктураЗаписи.Вставить("НомерПорта",НомерПорта);
	СтруктураЗаписи.Вставить("PID",PID);
	СтруктураЗаписи.Вставить("ИдентификаторУчастника",ИдентификаторУчастника);
	ОбновитьСоздатьУчастникаЧата(СтруктураЗаписи,Операция);
	
	Успешно=Ложь;
	ш=0;
	
	Пока Успешно=Ложь И ш<5 Цикл
		
		// TODO: тут порт должен дать сервер, но пока костыль
		Запрос = новый Запрос;
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	СУЧ.НомерПорта КАК НомерПорта
		|ИЗ
		|	РегистрСведений.СостояниеУчастниковДляЧата КАК СУЧ
		|ГДЕ
		|	НЕ СУЧ.НомерПорта = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПорта УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НомерПорта = Выборка.НомерПорта+1;
		Иначе
			НомерПорта= 1149;
		КонецЕсли;			
		
		СтруктураЗаписи.Вставить("НомерПорта",НомерПорта);
		ОбновитьИнформациюСтатусУчастникаЧата(СтруктураЗаписи,Операция);	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СУЧ.ИдентификаторУчастника КАК ИдентификаторУчастника,
		|	СУЧ.НомерПорта КАК НомерПорта
		|ИЗ
		|	РегистрСведений.СостояниеУчастниковДляЧата КАК СУЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеУчастниковДляЧата КАК СУЧ1
		|		ПО СУЧ.НомерПорта = СУЧ1.НомерПорта
		|ГДЕ
		|	СУЧ.НомерПорта = &НомерПорта
		|
		|УПОРЯДОЧИТЬ ПО
		|	СУЧ.ДатаПоследнейАктивностиУнив УБЫВ";
		Запрос.УстановитьПараметр("НомерПорта",СтруктураЗаписи.НомерПорта);
		Выборка = Запрос.Выполнить().Выбрать();
		
		
		Если Выборка.Количество()=1 Тогда
			Успешно=Истина;
		ИначеЕсли Выборка.Следующий() Тогда
			// если я был первым, то тапки мои
			Если Выборка.ИдентификаторУчастника=СтруктураЗаписи.ИдентификаторУчастника Тогда
				Успешно=Истина;
			КонецЕсли;
		КонецЕсли;
		
		ш=ш+1;
	КонецЦикла;
	
	Возврат Новый Структура("Успешно,ИмяВхода,НомерПорта,ИдентификаторУчастника",Успешно,ИмяВхода,НомерПорта,ИдентификаторУчастника);
	
КонецФункции

Процедура ОбновитьИнформациюСтатусУчастникаЧата(СтруктураЗаписи,Режим="обновить") Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СостояниеУчастниковДляЧата.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Активность=Истина;
	ИдентификаторУчастника = СтруктураЗаписи.ИдентификаторУчастника;
	Участник = СтруктураЗаписи.Участник;
	
	//// попробуем найти
	//Если СтруктураЗаписи.Свойство("ИдентификаторУчастника",ИдентификаторУчастника) Тогда		
	//	СвойстваУчатсникаИзБазы = ПолучитьСтатусУчатникаПоИдентиикатору(ИдентификаторУчастника);
	//	Если ЗначениеЗаполнено(СвойстваУчатсникаИзБазы.Участник) Тогда
	//		Участник = СвойстваУчатсникаИзБазы.Участник;	
	//	КонецЕсли;
	//КонецЕсли;
	
	Если Режим="добавить" Тогда
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтруктураЗаписи);
		МенеджерЗаписи.Записать(Ложь);
	ИначеЕсли Режим="обновить" Тогда
		Если НЕ Участник=Неопределено Тогда
			//МенеджерЗаписи.Участник=Участник;
			МенеджерЗаписи.ИдентификаторУчастника=ИдентификаторУчастника;
			МенеджерЗаписи.Прочитать();
			Если НЕ МенеджерЗаписи.ИдентификаторУчастника=СтруктураЗаписи.ИдентификаторУчастника И НЕ МенеджерЗаписи.ИдентификаторУчастника="" Тогда
				ВызватьИсключение "Имя уже занято!";
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтруктураЗаписи);
			МенеджерЗаписи.Записать(Истина);
		Иначе
			ВызватьИсключение "Не найден такой участник в чате, с ключом!";
		КонецЕсли;
	ИначеЕсли Режим="удалить" Тогда
		Если ИдентификаторУчастника=Неопределено Тогда
			//МенеджерЗаписи.Участник=СтруктураЗаписи.Участник;
			МенеджерЗаписи.ИдентификаторУчастника=СтруктураЗаписи.ИдентификаторУчастника;
		Иначе
			МенеджерЗаписи.ИдентификаторУчастника=ИдентификаторУчастника;
		КонецЕсли;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();	
	Иначе
		МенеджерЗаписи=Неопределено;
	Возврат;
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ОбновитьСоздатьУчастникаЧата(СтруктураЗаписи,Режим="обновить") Экспорт
	
	МенеджерЗаписи = РегистрыСведений.УчастникиДляЧата.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Активность=Истина;
	ИдентификаторУчастника = Неопределено;
	Участник = Неопределено;
	
	// попробуем найти
	Если СтруктураЗаписи.Свойство("ИдентификаторУчастника",ИдентификаторУчастника) Тогда		
		СвойстваУчатсникаИзБазы = ПолучитьСтатусУчатникаПоИдентиикатору(ИдентификаторУчастника);
		Если ЗначениеЗаполнено(СвойстваУчатсникаИзБазы.Участник) Тогда
			Участник = СвойстваУчатсникаИзБазы.Участник;	
		КонецЕсли;
	КонецЕсли;
	
	Если Режим="добавить" Тогда
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтруктураЗаписи);
		МенеджерЗаписи.Записать(Ложь);
	ИначеЕсли Режим="обновить" Тогда
		Если НЕ Участник=Неопределено Тогда
			//МенеджерЗаписи.Участник=Участник;
			МенеджерЗаписи.ИдентификаторУчастника=ИдентификаторУчастника;
			МенеджерЗаписи.Прочитать();
			Если НЕ МенеджерЗаписи.ИдентификаторУчастника=СтруктураЗаписи.ИдентификаторУчастника Тогда
				ВызватьИсключение "Имя уже занято!";
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтруктураЗаписи,,"ДатаСоздания");
			МенеджерЗаписи.Записать(Истина);
		Иначе
			ВызватьИсключение "Не найден такой участник в чате, с ключом!";
		КонецЕсли;
	ИначеЕсли Режим="удалить" Тогда
		Если ИдентификаторУчастника=Неопределено Тогда
			//МенеджерЗаписи.Участник=СтруктураЗаписи.Участник;
			МенеджерЗаписи.ИдентификаторУчастника=СтруктураЗаписи.ИдентификаторУчастника;
		Иначе
			МенеджерЗаписи.ИдентификаторУчастника=ИдентификаторУчастника;
		КонецЕсли;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();	
	Иначе
		МенеджерЗаписи=Неопределено;
	Возврат;
	КонецЕсли; 	
	
КонецПроцедуры

Функция  ПолучитьСтатусУчатникаПоИдентиикатору(Знач ИдентификаторУчастника) Экспорт
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Участник","");
	СтруктураЗаписи.Вставить("НомерПорта",0);
	СтруктураЗаписи.Вставить("ВСети",Ложь);
	СтруктураЗаписи.Вставить("ТестируемыйКлиент",Неопределено);
	СтруктураЗаписи.Вставить("Проверка",Неопределено);
	СтруктураЗаписи.Вставить("ДатаПоследнейАктивности",Дата(1,1,1));
	СтруктураЗаписи.Вставить("ДатаПоследнейАктивностиУнив",0);
	СтруктураЗаписи.Вставить("ДатаВхода",Дата(1,1,1));
	СтруктураЗаписи.Вставить("ТочкаВхода","");
	СтруктураЗаписи.Вставить("ИдентификаторУчастника","");
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Уч.ИдентификаторУчастника КАК ИдентификаторУчастника,
	|	Уч.Участник КАК Участник,
	|	ЕСТЬNULL(СУЧ.НомерПорта, 0) КАК НомерПорта,
	|	ЕСТЬNULL(СУЧ.ВСети, ЛОЖЬ) КАК ВСети,
	|	ЕСТЬNULL(СУЧ.ТестируемыйКлиент, НЕОПРЕДЕЛЕНО) КАК ТестируемыйКлиент,
	|	ЕСТЬNULL(СУЧ.Проверка, НЕОПРЕДЕЛЕНО) КАК Проверка,
	|	ЕСТЬNULL(СУЧ.ДатаПоследнейАктивности, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнейАктивности,
	|	ЕСТЬNULL(СУЧ.ДатаПоследнейАктивностиУнив, 0) КАК ДатаПоследнейАктивностиУнив,
	|	ЕСТЬNULL(СУЧ.ДатаВхода, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВхода,
	|	ЕСТЬNULL(СУЧ.ТочкаВхода, НЕОПРЕДЕЛЕНО) КАК ТочкаВхода
	|ИЗ
	|	РегистрСведений.УчастникиДляЧата КАК Уч
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеУчастниковДляЧата КАК СУЧ
	|		ПО (СУЧ.ИдентификаторУчастника = Уч.ИдентификаторУчастника)
	|ГДЕ
	|	Уч.ИдентификаторУчастника = &ИдентификаторУчастника";
	Запрос.УстановитьПараметр("ИдентификаторУчастника",ИдентификаторУчастника);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи,Выборка);
	КонецЕсли;
	
	Возврат СтруктураЗаписи;
КонецФункции

Функция ПолучитьТаблицуУчастниковЧата() Экспорт
	
	МассивСтруктурДанных = Новый Массив;
	
	ЗапросКоманты = Новый Запрос;
	ЗапросКоманты.Текст="ВЫБРАТЬ
	|	КомнатаДляЧата.ИдентификаторКомнаты КАК ИдентификаторКомнаты,
	|	КомнатаДляЧата.Комната КАК Комната,
	|	КомнатаДляЧата.ИдентификаторАдминистратора КАК ИдентификаторАдминистратора,
	|	КомнатаДляЧата.ДатаСоздания КАК ДатаСоздания,
	|	КомнатаДляЧата.Проверка КАК Проверка,
	|	КомнатаДляЧата.Сборка КАК Сборка,
	|	ЕСТЬNULL(Подзапрос1.КоличествоУчастников, 0) КАК КоличествоУчастников
	|ИЗ
	|	РегистрСведений.КомнатыДляЧата КАК КомнатаДляЧата
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СоставКоманты.ИдентификаторКомнаты КАК ИдентификаторКомнаты,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоставКоманты.ИдентификаторУчастника) КАК КоличествоУчастников
	|		ИЗ
	|			РегистрСведений.СоставКомнатыДляЧата КАК СоставКоманты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СоставКоманты.ИдентификаторКомнаты) КАК Подзапрос1
	|		ПО (Подзапрос1.ИдентификаторКомнаты = КомнатаДляЧата.ИдентификаторКомнаты)";
	
	
	
	ЗапросУчастники = Новый Запрос;
	ЗапросУчастники.Текст="ВЫБРАТЬ
	|	УчастникиЧата.Участник КАК Участник,
	|	ВЫРАЗИТЬ(УчастникиЧата.Участник КАК СТРОКА(50)) КАК ПредставлениеУчастник,
	|	ЕСТЬNULL(Подзапрос.ЕстьНовыеСообщения, ЛОЖЬ) КАК ЕстьНовыеСообщения,
	|	ЕСТЬNULL(СУЧ.НомерПорта, 0) КАК НомерПорта,
	|	ЕСТЬNULL(СУЧ.ВСети, ЛОЖЬ) КАК ВСети,
	|	ЕСТЬNULL(СУЧ.ТестируемыйКлиент, НЕОПРЕДЕЛЕНО) КАК ТестируемыйКлиент,
	|	ЕСТЬNULL(СУЧ.Проверка, НЕОПРЕДЕЛЕНО) КАК Проверка,
	|	ЕСТЬNULL(СУЧ.ДатаПоследнейАктивности, НЕОПРЕДЕЛЕНО) КАК ДатаПоследнейАктивности,
	|	ЕСТЬNULL(СУЧ.ДатаПоследнейАктивностиУнив, 0) КАК ДатаПоследнейАктивностиУнив,
	|	ЕСТЬNULL(СУЧ.ДатаВхода, НЕОПРЕДЕЛЕНО) КАК ДатаВхода,
	|	ЕСТЬNULL(СУЧ.ДатаВыхода, НЕОПРЕДЕЛЕНО) КАК ДатаВыхода,
	|	ЕСТЬNULL(СУЧ.ТочкаВхода, """") КАК ТочкаВхода,
	|	УчастникиЧата.ИдентификаторУчастника КАК ИдентификаторУчастника
	|ИЗ
	|	РегистрСведений.УчастникиДляЧата КАК УчастникиЧата
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СообщенияИзЧата.ИдентификаторУчастника КАК ИдентификаторУчастника,
	|			ИСТИНА КАК ЕстьНовыеСообщения
	|		ИЗ
	|			РегистрСведений.СтатусыСообщенийЧата КАК СообщенияИзЧата
	|		ГДЕ
	|			СообщенияИзЧата.Получено = ЛОЖЬ) КАК Подзапрос
	|		ПО (Подзапрос.ИдентификаторУчастника = УчастникиЧата.ИдентификаторУчастника)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеУчастниковДляЧата КАК СУЧ
	|		ПО (СУЧ.ИдентификаторУчастника = УчастникиЧата.ИдентификаторУчастника)";
	
	
	ЗапросУчастникиВКомнатах = Новый Запрос;
	ЗапросУчастникиВКомнатах.Текст="ВЫБРАТЬ
	|	УчастникиЧата.Участник КАК Участник,
	|	ВЫРАЗИТЬ(УчастникиЧата.Участник КАК СТРОКА(50)) КАК ПредставлениеУчастник,
	|	ЕСТЬNULL(Подзапрос.ЕстьНовыеСообщения, ЛОЖЬ) КАК ЕстьНовыеСообщения,
	|	ЕСТЬNULL(СУЧ.НомерПорта, 0) КАК НомерПорта,
	|	ЕСТЬNULL(СУЧ.ВСети, ЛОЖЬ) КАК ВСети,
	|	ЕСТЬNULL(СУЧ.ТестируемыйКлиент, НЕОПРЕДЕЛЕНО) КАК ТестируемыйКлиент,
	|	ЕСТЬNULL(СУЧ.Проверка, НЕОПРЕДЕЛЕНО) КАК Проверка,
	|	ЕСТЬNULL(СУЧ.ДатаПоследнейАктивности, НЕОПРЕДЕЛЕНО) КАК ДатаПоследнейАктивности,
	|	ЕСТЬNULL(СУЧ.ДатаПоследнейАктивностиУнив, 0) КАК ДатаПоследнейАктивностиУнив,
	|	ЕСТЬNULL(СУЧ.ДатаВхода, НЕОПРЕДЕЛЕНО) КАК ДатаВхода,
	|	ЕСТЬNULL(СУЧ.ДатаВыхода, НЕОПРЕДЕЛЕНО) КАК ДатаВыхода,
	|	ЕСТЬNULL(СУЧ.ТочкаВхода, """") КАК ТочкаВхода,
	|	УчастникиЧата.ИдентификаторУчастника КАК ИдентификаторУчастника,
	|	ЕСТЬNULL(КомнатыДляЧата.ИдентификаторКомнаты,"""") КАК ИдентификаторКомнаты,
	|	ЕСТЬNULL(КомнатыДляЧата.Комната,"""") КАК Комната
	|ИЗ
	|	РегистрСведений.УчастникиДляЧата КАК УчастникиЧата
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СообщенияИзЧата.ИдентификаторУчастника КАК ИдентификаторУчастника,
	|			ИСТИНА КАК ЕстьНовыеСообщения
	|		ИЗ
	|			РегистрСведений.СтатусыСообщенийЧата КАК СообщенияИзЧата
	|		ГДЕ
	|			СообщенияИзЧата.Получено = ЛОЖЬ) КАК Подзапрос
	|		ПО (Подзапрос.ИдентификаторУчастника = УчастникиЧата.ИдентификаторУчастника)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеУчастниковДляЧата КАК СУЧ
	|		ПО (СУЧ.ИдентификаторУчастника = УчастникиЧата.ИдентификаторУчастника)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставКомнатыДляЧата КАК СоставКомнатыДляЧата
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомнатыДляЧата КАК КомнатыДляЧата
	|			ПО СоставКомнатыДляЧата.ИдентификаторКомнаты = КомнатыДляЧата.ИдентификаторКомнаты
	|		ПО УчастникиЧата.ИдентификаторУчастника = СоставКомнатыДляЧата.ИдентификаторУчастника";
	
	
		
	стр_н = ПолучитьСтруктуруОписанияТаблицыУчастниковЧата();
	стр_н.Комната="Общий (всем участникам)";
	стр_н.ИдентификаторКартинки=6;
	МассивСтруктурДанных.Добавить(стр_н);
	
	
	ВыборкаУчастники = ЗапросУчастники.Выполнить().Выбрать();
	
	
	Пока ВыборкаУчастники.Следующий() Цикл
		стр_н = ПолучитьСтруктуруОписанияТаблицыУчастниковЧата();
		ЗаполнитьЗначенияСвойств(стр_н,ВыборкаУчастники);
		стр_н.Комната="--";
		стр_н.ИдентификаторКартинки=?(стр_н.Всети,4,1);
		МассивСтруктурДанных.Добавить(стр_н);
	КонецЦикла;
	
	
	ВыборкаКоманты = ЗапросКоманты.Выполнить().Выбрать();
	
	Пока ВыборкаКоманты.Следующий() Цикл
		стр_н = ПолучитьСтруктуруОписанияТаблицыУчастниковЧата();
		ЗаполнитьЗначенияСвойств(стр_н,ВыборкаКоманты);
		стр_н.ИдентификаторКартинки=5;
		МассивСтруктурДанных.Добавить(стр_н);
	КонецЦикла;
	
	ВыборкаУчастникиПоКомнатам = ЗапросУчастникиВКомнатах.Выполнить().Выбрать();
	
	Пока ВыборкаУчастникиПоКомнатам.Следующий() Цикл
		стр_н = ПолучитьСтруктуруОписанияТаблицыУчастниковЧата();
		ЗаполнитьЗначенияСвойств(стр_н,ВыборкаУчастникиПоКомнатам);
		стр_н.ИдентификаторКартинки=?(стр_н.Всети,4,1);;
		МассивСтруктурДанных.Добавить(стр_н);
	КонецЦикла;
	
	Возврат МассивСтруктурДанных;	
	
КонецФункции

Функция ПолучитьСтруктуруОписанияТаблицыУчастниковЧата() Экспорт
	СтруктураСтроки = Новый Структура();
	СтруктураСтроки.Вставить("Комната","");
	СтруктураСтроки.Вставить("ИдентификаторКомнаты","");
	СтруктураСтроки.Вставить("Участник","");
	СтруктураСтроки.Вставить("ИдентификаторУчастника","");
	СтруктураСтроки.Вставить("ВСети",Ложь);
	СтруктураСтроки.Вставить("ЕстьНовыеСообщения",Ложь);
	СтруктураСтроки.Вставить("КоличествоУчастников",0);
	СтруктураСтроки.Вставить("ИдентификаторКартинки",0);
	СтруктураСтроки.Вставить("НомерПорта",0);
	СтруктураСтроки.Вставить("ТочкаВхода","");
	Возврат СтруктураСтроки;
КонецФункции

Процедура ОбновитьДатуАктивностиСтатусаУчастника(Знач ИдентификаторУчастника) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СостояниеУчастниковДляЧата.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.ИдентификаторУчастника=ИдентификаторУчастника;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.ВСети=Истина;
	МенеджерЗаписи.ДатаПоследнейАктивности=ТекущаяДата();
	МенеджерЗаписи.ДатаПоследнейАктивностиУнив=ТекущаяУниверсальнаяДатаВМиллисекундах();
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Функция  ПолучитьСтатусУчатникаПоИмениУчастника(Знач Участник) Экспорт
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Участник","");
	СтруктураЗаписи.Вставить("НомерПорта",0);
	СтруктураЗаписи.Вставить("ВСети",Ложь);
	СтруктураЗаписи.Вставить("ТестируемыйКлиент",Неопределено);
	СтруктураЗаписи.Вставить("Проверка",Неопределено);
	СтруктураЗаписи.Вставить("ДатаПоследнейАктивности",Дата(1,1,1));
	СтруктураЗаписи.Вставить("ДатаПоследнейАктивностиУнив",0);
	СтруктураЗаписи.Вставить("ДатаВхода",Дата(1,1,1));
	СтруктураЗаписи.Вставить("ТочкаВхода","");
	СтруктураЗаписи.Вставить("ИдентификаторУчастника","");
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Уч.Участник КАК Участник,
	|	СУЧ.НомерПорта КАК НомерПорта,
	|	СУЧ.ВСети КАК ВСети,
	|	СУЧ.ТестируемыйКлиент КАК ТестируемыйКлиент,
	|	СУЧ.Проверка КАК Проверка,
	|	СУЧ.ДатаПоследнейАктивности КАК ДатаПоследнейАктивности,
	|	СУЧ.ДатаПоследнейАктивностиУнив КАК ДатаПоследнейАктивностиУнив,
	|	СУЧ.ДатаВхода КАК ДатаВхода,
	|	СУЧ.ТочкаВхода КАК ТочкаВхода,
	|	СУЧ.ИдентификаторУчастника КАК ИдентификаторУчастника
	|ИЗ
	|	РегистрСведений.СостояниеУчастниковДляЧата КАК СУЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиДляЧата КАК Уч
	|		ПО СУЧ.ИдентификаторУчастника = Уч.ИдентификаторУчастника
	|ГДЕ
	|	Уч.Участник = &Участник";
	Запрос.УстановитьПараметр("Участник",Участник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи,Выборка);
	КонецЕсли;
	
	Возврат СтруктураЗаписи;
КонецФункции

Функция ПолучитьСостоянияУчастников(Знач ПараметрыУчастников) Экспорт
	
	МассивСвойствСострянияУчастников = Новый Массив;
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Участник",Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ИдентификаторУчастника",Новый ОписаниеТипов("Строка"));
	
	Для каждого стр из ПараметрыУчастников Цикл
		стр_н = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(стр_н,стр);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗ.Участник КАК СТРОКА(155)) КАК Участник,
	|	ВЫРАЗИТЬ(ТЗ.ИдентификаторУчастника КАК СТРОКА(36)) КАК ИдентификаторУчастника
	|ПОМЕСТИТЬ ВтТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчастникиДляЧата.Участник КАК Участник,
	|	УчастникиДляЧата.ИдентификаторУчастника КАК ИдентификаторУчастника,
	|	СостояниеУчастниковДляЧата.НомерПорта КАК НомерПорта,
	|	СостояниеУчастниковДляЧата.ВСети КАК ВСети,
	|	СостояниеУчастниковДляЧата.ДатаПоследнейАктивности КАК ДатаПоследнейАктивности,
	|	СостояниеУчастниковДляЧата.PID КАК PID
	|ИЗ
	|	РегистрСведений.УчастникиДляЧата КАК УчастникиДляЧата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеУчастниковДляЧата КАК СостояниеУчастниковДляЧата
	|		ПО УчастникиДляЧата.ИдентификаторУчастника = СостояниеУчастниковДляЧата.ИдентификаторУчастника
	|ГДЕ
	|	(УчастникиДляЧата.Участник В
	|				(ВЫБРАТЬ
	|					Т.Участник
	|				ИЗ
	|					ВтТЗ КАК Т)
	|			ИЛИ УчастникиДляЧата.ИдентификаторУчастника В
	|				(ВЫБРАТЬ
	|					Т.ИдентификаторУчастника
	|				ИЗ
	|					ВтТЗ КАК Т))";
	Запрос.УстановитьПараметр("ТЗ",Таблица);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Свойство = Новый Структура();
		Свойство.Вставить("Участник",Выборка.Участник);
		Свойство.Вставить("ИдентификаторУчастника",Выборка.ИдентификаторУчастника);
		Свойство.Вставить("НомерПорта",Выборка.НомерПорта);
		Свойство.Вставить("ВСети",Выборка.ВСети);
		Свойство.Вставить("PID",Выборка.PID);
		Свойство.Вставить("ДатаПоследнейАктивности",Выборка.ДатаПоследнейАктивности);
		МассивСвойствСострянияУчастников.Добавить(Свойство);
		
	КонецЦикла;	
	
	Возврат МассивСвойствСострянияУчастников;
	
КонецФункции

#КонецОбласти

#Область СообщенияЧата

Функция ПолучитьСообщенияЧата(Знач ИдентификаторКомнаты,Знач ИдентификаторОтправителя,Знач ИдентификаторПолучателя,Знач ГлубинаЧата=24,Знач ГлубинаЧатаСообщений=42) Экспорт
	
	МассивСтруктурДанных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 42
	|	ЕСТЬNULL(ОтправительСообщения.Участник, """") КАК Отправитель,
	|	Сообщения.ИдентификаторОтправителя КАК ИдентификаторОтправителя,
	|	ЕСТЬNULL(ПолучательСообщения.Участник, """") КАК Получатель,
	|	Сообщения.ИдентификаторПолучателя КАК ИдентификаторПолучателя,
	|	ЕСТЬNULL(КомнатаЧата.Комната, """") КАК Комната,
	|	Сообщения.ИдентификаторКомнаты КАК ИдентификаторКомнаты,
	|	Сообщения.ДатаСообщения КАК ДатаСообщения,
	|	Сообщения.Сообщение КАК Сообщение,
	|	Сообщения.ДатаСообщенияУнив КАК ДатаСообщенияУнив
	|ИЗ
	|	РегистрСведений.СообщенияИзЧата КАК Сообщения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиДляЧата КАК ОтправительСообщения
	|		ПО (ОтправительСообщения.ИдентификаторУчастника = Сообщения.ИдентификаторОтправителя)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиДляЧата КАК ПолучательСообщения
	|		ПО (ПолучательСообщения.ИдентификаторУчастника = Сообщения.ИдентификаторПолучателя)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомнатыДляЧата КАК КомнатаЧата
	|		ПО (КомнатаЧата.ИдентификаторКомнаты = Сообщения.ИдентификаторКомнаты)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Сообщения.ИдентификаторПолучателя = """"
	|					И НЕ &ИдентификаторПолучателя = &ИдентификаторОтправителя
	|				ТОГДА ИСТИНА
	|			КОГДА &ИдентификаторОтправителя = """"
	|					И НЕ &ИдентификаторПолучателя = &ИдентификаторОтправителя
	|				ТОГДА ИСТИНА
	|			КОГДА Сообщения.ИдентификаторПолучателя = &ИдентификаторПолучателя
	|						И Сообщения.ИдентификаторОтправителя = &ИдентификаторОтправителя
	|					ИЛИ Сообщения.ИдентификаторПолучателя = &ИдентификаторОтправителя
	|						И Сообщения.ИдентификаторОтправителя = &ИдентификаторПолучателя
	|				ТОГДА ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Сообщения.ИдентификаторКомнаты = &ИдентификаторКомнаты
	//|					И НЕ &ИдентификаторКомнаты = """"
	|				ТОГДА Сообщения.ИдентификаторКомнаты = &ИдентификаторКомнаты
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И Сообщения.ДатаСообщения > &ДатаОграниченияПолучения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСообщенияУнив УБЫВ";
	
	Запрос.УстановитьПараметр("ИдентификаторПолучателя",ИдентификаторПолучателя);
	Запрос.УстановитьПараметр("ИдентификаторОтправителя",ИдентификаторОтправителя);
	Запрос.УстановитьПараметр("ИдентификаторКомнаты",ИдентификаторКомнаты);
	Запрос.УстановитьПараметр("ДатаОграниченияПолучения",ТекущаяДата()-ГлубинаЧата*60*60);
	Запрос.УстановитьПараметр("ГлубинаЧатаСообщений",ГлубинаЧатаСообщений);
	
	// первые
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВЫБРАТЬ ПЕРВЫЕ 42","ВЫБРАТЬ ПЕРВЫЕ "+Формат(ГлубинаЧатаСообщений,"ЧГ=0"));
	
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ш=Таблица.Количество();
	
	Пока ш>0 Цикл
		ш=ш-1;
		стр_н = ОбщийЧатКлиентСервер.ПолучитьСтруктуруСообщенияЧата();
		ЗаполнитьЗначенияСвойств(стр_н,Таблица[ш]);
		МассивСтруктурДанных.Добавить(стр_н);
	КонецЦикла;
	
	Возврат МассивСтруктурДанных;
	
КонецФункции


Процедура ОтправитьСообщениеВЧат(СтруктураСообщения) Экспорт
	
	ИдентификаторСообщения = Строка(Новый UUID());
	
	МенеджерЗаписи = РегистрыСведений.СообщенияИзЧата.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Активность = Истина;
	МенеджерЗаписи.ДатаСообщенияУнив=ТекущаяУниверсальнаяДатаВМиллисекундах();
	МенеджерЗаписи.ДатаСообщения=ТекущаяДата();
	МенеджерЗаписи.ИдентификаторОтправителя=СтруктураСообщения.ИдентификаторОтправителя;
	МенеджерЗаписи.ИдентификаторПолучателя=СтруктураСообщения.ИдентификаторПолучателя;
	МенеджерЗаписи.ИдентификаторКомнаты=СтруктураСообщения.ИдентификаторКомнаты;
	МенеджерЗаписи.Сообщение=СтруктураСообщения.Сообщение;
	МенеджерЗаписи.ЭтоОтвет=СтруктураСообщения.ЭтоОтвет;
	МенеджерЗаписи.ИдентификаторСообщения=ИдентификаторСообщения;
	
	МенеджерЗаписи.Записать();
	
	// отправим всем в общем чате
	Если СтруктураСообщения.ИдентификаторПолучателя="" И СтруктураСообщения.ИдентификаторКомнаты="" Тогда
		
		// получим список всех получателей
		Запрос = Новый Запрос();
		Запрос.Текст="ВЫБРАТЬ
		|	УЧ.Участник КАК Участник,
		|	УЧ.ИдентификаторУчастника КАК ИдентификаторУчастника
		|ИЗ
		|	РегистрСведений.УчастникиДляЧата КАК УЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеУчастниковДляЧата КАК СУЧ
		|		ПО (СУЧ.ИдентификаторУчастника = УЧ.ИдентификаторУчастника)
		|ГДЕ
		|	СУЧ.ВСети = ИСТИНА
		|	И НЕ УЧ.ИдентификаторУчастника = &ИдентификаторУчастника";
		Запрос.УстановитьПараметр("Участник",СтруктураСообщения.Отправитель);
		Запрос.УстановитьПараметр("ИдентификаторУчастника",СтруктураСообщения.ИдентификаторОтправителя);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество()>0 Тогда
			НаборЗаписей = РегистрыСведений.СтатусыСообщенийЧата.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
			Пока Выборка.Следующий() Цикл
				Запись = НаборЗаписей.Добавить();
				Запись.ИдентификаторСообщения=ИдентификаторСообщения;
				Запись.ИдентификаторУчастника=Выборка.ИдентификаторУчастника;
			КонецЦикла;
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		
	// отправим всем в комнате
	ИначеЕсли СтруктураСообщения.ИдентификаторПолучателя="" И НЕ СтруктураСообщения.ИдентификаторКомнаты="" Тогда
		
		// получим список всех получателей
		Запрос = Новый Запрос();
		Запрос.Текст="ВЫБРАТЬ
		|	УЧ.Участник КАК Участник,
		|	УЧ.ИдентификаторУчастника КАК ИдентификаторУчастника
		|ИЗ
		|	РегистрСведений.УчастникиДляЧата КАК УЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеУчастниковДляЧата КАК СУЧ
		|		ПО (СУЧ.ИдентификаторУчастника = УЧ.ИдентификаторУчастника)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставКомнатыДляЧата КАК СоставКомнатыДляЧата
		|		ПО УЧ.ИдентификаторУчастника = СоставКомнатыДляЧата.ИдентификаторУчастника
		|ГДЕ
		|	СУЧ.ВСети = ИСТИНА
		|	И НЕ УЧ.ИдентификаторУчастника = &ИдентификаторУчастника
		|	И СоставКомнатыДляЧата.ИдентификаторКомнаты = &ИдентификаторКомнаты";
		Запрос.УстановитьПараметр("Участник",СтруктураСообщения.Отправитель);
		Запрос.УстановитьПараметр("ИдентификаторУчастника",СтруктураСообщения.ИдентификаторОтправителя);
		Запрос.УстановитьПараметр("ИдентификаторКомнаты",СтруктураСообщения.ИдентификаторКомнаты);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество()>0 Тогда
			НаборЗаписей = РегистрыСведений.СтатусыСообщенийЧата.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
			Пока Выборка.Следующий() Цикл
				Запись = НаборЗаписей.Добавить();
				Запись.ИдентификаторСообщения=ИдентификаторСообщения;
				Запись.ИдентификаторУчастника=Выборка.ИдентификаторУчастника;
			КонецЦикла;
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
	// отправим адресату
	Иначе
		МенеджерЗаписи = РегистрыСведений.СтатусыСообщенийЧата.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторСообщения=ИдентификаторСообщения;
		МенеджерЗаписи.ИдентификаторУчастника=СтруктураСообщения.ИдентификаторПолучателя;
		МенеджерЗаписи.Получено=Ложь;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	// обновим статус
	ОбновитьДатуАктивностиСтатусаУчастника(СтруктураСообщения.ИдентификаторОтправителя);
	
КонецПроцедуры


Функция ПолучитьНовыеСообщения(Знач ИдентификаторУчастника)  Экспорт
	
	МассивСтруктурСообщений = Новый Массив;
	
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СообщенияИзЧата.ДатаСообщения КАК ДатаСообщения,
	|	СообщенияИзЧата.Сообщение КАК Сообщение,
	|	СообщенияИзЧата.ВремяЖизни КАК ВремяЖизни,
	|	СообщенияИзЧата.ЭтоОтвет КАК ЭтоОтвет,
	|	СообщенияИзЧата.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	ЕСТЬNULL(Отправитель.Участник, """") КАК Отправитель,
	|	СообщенияИзЧата.ИдентификаторОтправителя КАК ИдентификаторОтправителя,
	|	ЕСТЬNULL(Получатель.Участник, """") КАК Получатель,
	|	СообщенияИзЧата.ИдентификаторПолучателя КАК ИдентификаторПолучателя,
	|	ЕСТЬNULL(КомнатыДляЧата.Комната, """") КАК Комната,
	|	СообщенияИзЧата.ИдентификаторКомнаты КАК ИдентификаторКомнаты
	|ИЗ
	|	РегистрСведений.СтатусыСообщенийЧата КАК СтатусыСообщенийЧата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СообщенияИзЧата КАК СообщенияИзЧата
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиДляЧата КАК Отправитель
	|			ПО СообщенияИзЧата.ИдентификаторОтправителя = Отправитель.ИдентификаторУчастника
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиДляЧата КАК Получатель
	|			ПО СообщенияИзЧата.ИдентификаторОтправителя = Получатель.ИдентификаторУчастника
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомнатыДляЧата КАК КомнатыДляЧата
	|			ПО СообщенияИзЧата.ИдентификаторКомнаты = КомнатыДляЧата.ИдентификаторКомнаты
	|		ПО СтатусыСообщенийЧата.ИдентификаторСообщения = СообщенияИзЧата.ИдентификаторСообщения
	|ГДЕ
	|	СтатусыСообщенийЧата.ИдентификаторУчастника = &ИдентификаторУчастника
	|	И СтатусыСообщенийЧата.Получено = ЛОЖЬ";                        
	Запрос.УстановитьПараметр("ИдентификаторУчастника",ИдентификаторУчастника);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураСообщения = Новый Структура("Сообщение,ИдентификаторСообщения,Отправитель,
		|ИдентификаторОтправителя,Получатель,ИдентификаторПолучателя,ЭтоОтвет,Комната,ИдентификаторКомнаты");
		ЗаполнитьЗначенияСвойств(СтруктураСообщения,Выборка);
		МассивСтруктурСообщений.Добавить(СтруктураСообщения);
		
		МенеджерЗаписи = РегистрыСведений.СтатусыСообщенийЧата.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторУчастника=ИдентификаторУчастника;
		МенеджерЗаписи.ИдентификаторСообщения=Выборка.ИдентификаторСообщения;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Получено=Истина;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	// обновим статус
	ОбновитьДатуАктивностиСтатусаУчастника(ИдентификаторУчастника);
	
	Возврат МассивСтруктурСообщений;
	
КонецФункции


#КонецОбласти

#Область Комнаты

Функция ЗайтиВИгровуюКомнату(Знач ИдентификаторУчастника,Знач ИгроваяКомната) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СоставКомнатыДляЧата.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторКомнаты = ИгроваяКомната;
	МенеджерЗаписи.ИдентификаторУчастника = ИдентификаторУчастника;
	МенеджерЗаписи.Записать(Истина);
	
	Возврат Истина;
	
КонецФункции

Функция ВыйтиИзИгровойКомнаты(Знач ИдентификаторУчастника,Знач ИгроваяКомната) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СКЧата.ИдентификаторКомнаты КАК ИдентификаторКомнаты,
	|	СКЧата.ИдентификаторУчастника КАК ИдентификаторУчастника
	|ИЗ
	|	РегистрСведений.СоставКомнатыДляЧата КАК СКЧата
	|ГДЕ
	|	СКЧата.ИдентификаторУчастника = &ИдентификаторУчастника
	|	И СКЧата.ИдентификаторКомнаты = &ИдентификаторКомнаты";
	Запрос.УстановитьПараметр("ИдентификаторУчастника",ИдентификаторУчастника);
	Запрос.УстановитьПараметр("ИдентификаторКомнаты",ИгроваяКомната);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.СоставКомнатыДляЧата.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторКомнаты = Выборка.ИдентификаторКомнаты;
		МенеджерЗаписи.ИдентификаторУчастника = Выборка.ИдентификаторУчастника;
		МенеджерЗаписи.Удалить();
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ВыйтиИзВсехИгровыхКомнат(Знач ИдентификаторУчастника) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СКЧата.ИдентификаторКомнаты КАК ИдентификаторКомнаты,
	|	СКЧата.ИдентификаторУчастника КАК ИдентификаторУчастника
	|ИЗ
	|	РегистрСведений.СоставКомнатыДляЧата КАК СКЧата
	|ГДЕ
	|	СКЧата.ИдентификаторУчастника = &ИдентификаторУчастника";
	Запрос.УстановитьПараметр("ИдентификаторУчастника",ИдентификаторУчастника);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.СоставКомнатыДляЧата.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторКомнаты = Выборка.ИдентификаторКомнаты;
		МенеджерЗаписи.ИдентификаторУчастника = Выборка.ИдентификаторУчастника;
		МенеджерЗаписи.Удалить();
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
